In [79]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import matplotlib.style as style

In [80]:
%matplotlib inline
style.use('seaborn-poster')
style.use('ggplot')
plt.rc('figure',figsize=(10,4))

In [81]:
df = pd.read_csv('data.csv')

In [82]:
df.head()

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,2014-05-02 00:00:00,313000.0,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,2014-05-02 00:00:00,2384000.0,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA
2,2014-05-02 00:00:00,342000.0,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,Kent,WA 98042,USA
3,2014-05-02 00:00:00,420000.0,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,857 170th Pl NE,Bellevue,WA 98008,USA
4,2014-05-02 00:00:00,550000.0,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992,9105 170th Ave NE,Redmond,WA 98052,USA

## Listing and Checking the data types of the  various variables.

In [83]:
for i,col in enumerate(df.columns):
    print(i,col)

0 date
1 price
2 bedrooms
3 bathrooms
4 sqft_living
5 sqft_lot
6 floors
7 waterfront
8 view
9 condition
10 sqft_above
11 sqft_basement
12 yr_built
13 yr_renovated
14 street
15 city
16 statezip
17 country

In [84]:
# Taking a general overview of the data.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4600 entries, 0 to 4599
Data columns (total 18 columns):
date             4600 non-null object
price            4600 non-null float64
bedrooms         4600 non-null float64
bathrooms        4600 non-null float64
sqft_living      4600 non-null int64
sqft_lot         4600 non-null int64
floors           4600 non-null float64
waterfront       4600 non-null int64
view             4600 non-null int64
condition        4600 non-null int64
sqft_above       4600 non-null int64
sqft_basement    4600 non-null int64
yr_built         4600 non-null int64
yr_renovated     4600 non-null int64
street           4600 non-null object
city             4600 non-null object
statezip         4600 non-null object
country          4600 non-null object
dtypes: float64(4), int64(9), object(5)
memory usage: 647.0+ KB

In [85]:
df.dtypes

date              object
price            float64
bedrooms         float64
bathrooms        float64
sqft_living        int64
sqft_lot           int64
floors           float64
waterfront         int64
view               int64
condition          int64
sqft_above         int64
sqft_basement      int64
yr_built           int64
yr_renovated       int64
street            object
city              object
statezip          object
country           object
dtype: object

In [86]:
# Describing the numeric variables in the original data.
df.describe(include = 'number')

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated
count,4.600000e+03,4600.000000,4600.000000,4600.000000,4.600000e+03,4600.000000,4600.000000,4600.000000,4600.000000,4600.000000,4600.000000,4600.000000,4600.000000
mean,5.519630e+05,3.400870,2.160815,2139.346957,1.485252e+04,1.512065,0.007174,0.240652,3.451739,1827.265435,312.081522,1970.786304,808.608261
std,5.638347e+05,0.908848,0.783781,963.206916,3.588444e+04,0.538288,0.084404,0.778405,0.677230,862.168977,464.137228,29.731848,979.414536
min,0.000000e+00,0.000000,0.000000,370.000000,6.380000e+02,1.000000,0.000000,0.000000,1.000000,370.000000,0.000000,1900.000000,0.000000
25%,3.228750e+05,3.000000,1.750000,1460.000000,5.000750e+03,1.000000,0.000000,0.000000,3.000000,1190.000000,0.000000,1951.000000,0.000000
50%,4.609435e+05,3.000000,2.250000,1980.000000,7.683000e+03,1.500000,0.000000,0.000000,3.000000,1590.000000,0.000000,1976.000000,0.000000
75%,6.549625e+05,4.000000,2.500000,2620.000000,1.100125e+04,2.000000,0.000000,0.000000,4.000000,2300.000000,610.000000,1997.000000,1999.000000
max,2.659000e+07,9.000000,8.000000,13540.000000,1.074218e+06,3.500000,1.000000,4.000000,5.000000,9410.000000,4820.000000,2014.000000,2014.000000

In [87]:
# Describing the non-numeric variables in the original data
df.describe(include = 'object')

                       date                 street     city  statezip country
count                  4600                   4600     4600      4600    4600
unique                   70                   4525       44        77       1
top     2014-06-23 00:00:00  2520 Mulberry Walk NE  Seattle  WA 98103     USA
freq                    142                      4     1573       148    4600

#  Changing variables to the right data types.

In [88]:
# Changing date column to datetime data type.
df['date'] = pd.to_datetime(df['date'])

print(df['date'].dtypes)

datetime64[ns]

In [94]:
df['bedrooms'] = df['bedrooms'].astype(int)

In [95]:
df['bedrooms'].describe()

count    4600.000000
mean        3.400870
std         0.908848
min         0.000000
25%         3.000000
50%         3.000000
75%         4.000000
max         9.000000
Name: bedrooms, dtype: float64

In [100]:
df.dtypes

date             datetime64[ns]
price                   float64
bedrooms                  int32
bathrooms               float64
sqft_living               int64
sqft_lot                  int64
floors                  float64
waterfront                int64
view                      int64
condition                 int64
sqft_above                int64
sqft_basement             int64
yr_built                  int64
yr_renovated              int64
street                   object
city                     object
statezip                 object
country                  object
dtype: object

# Dealing with missing values

In [104]:
# setting the zero values of price as NaN.
df['price'][df['price']==0.0].count()

49

In [105]:
df['price'].replace(0.0,np.nan,inplace = True)

In [106]:
print(df['bedrooms'][df['bedrooms']==0.0].count())
print(df['bathrooms'][df['bathrooms']==0.0].count())

2
2

In [108]:
# setting the zero values of bedrooms and bathrooms as NaN.
df['bedrooms'].replace(0.0,np.nan,inplace = True)
df['bathrooms'].replace(0.0,np.nan,inplace = True)

In [121]:
df['price'][df['price'].isna()== True]

4354   NaN
4356   NaN
4357   NaN
4358   NaN
4361   NaN
4362   NaN
4374   NaN
4376   NaN
4382   NaN
4383   NaN
4385   NaN
4386   NaN
4389   NaN
4394   NaN
4405   NaN
4408   NaN
4411   NaN
4412   NaN
4413   NaN
4420   NaN
4442   NaN
4448   NaN
4453   NaN
4454   NaN
4472   NaN
4478   NaN
4479   NaN
4480   NaN
4481   NaN
4487   NaN
4499   NaN
4507   NaN
4509   NaN
4520   NaN
4521   NaN
4522   NaN
4523   NaN
4528   NaN
4534   NaN
4542   NaN
4552   NaN
4554   NaN
4555   NaN
4558   NaN
4563   NaN
4567   NaN
4574   NaN
4575   NaN
4588   NaN
Name: price, dtype: float64

In [126]:
# Replace the NaN in  the price variable with the mean price of the houses.
mean_price = np.mean(df['price'])
print(mean_price)
df['price'].replace(np.nan,mean_price,inplace = True)

557905.8991379443

In [130]:
df['bedrooms'].value_counts()

3.0    2032
4.0    1531
2.0     566
5.0     353
6.0      61
1.0      38
7.0      14
8.0       2
9.0       1
Name: bedrooms, dtype: int64

In [131]:
# Replace the NaN in the bedrooms column with the most frequent number which is 3 in this case.
df['bedrooms'].replace(np.nan,3,inplace = True)

In [132]:
df['bathrooms'].value_counts()

2.50    1189
1.00     743
1.75     629
2.00     427
2.25     419
1.50     291
2.75     276
3.00     167
3.50     162
3.25     136
3.75      37
4.50      29
4.00      23
4.25      23
0.75      17
4.75       7
5.00       6
5.50       4
5.25       4
1.25       3
6.25       2
8.00       1
6.50       1
5.75       1
6.75       1
Name: bathrooms, dtype: int64

In [133]:
# Replace the NaN in the bedrooms column with the most frequent number which is 2.50 in this case.
df['bathrooms'].replace(np.nan,2.50,inplace = True)

In [135]:
df.count()

date             4600
price            4600
bedrooms         4600
bathrooms        4600
sqft_living      4600
sqft_lot         4600
floors           4600
waterfront       4600
view             4600
condition        4600
sqft_above       4600
sqft_basement    4600
yr_built         4600
yr_renovated     4600
street           4600
city             4600
statezip         4600
country          4600
dtype: int64

In [137]:
categorical_variable = ['street','city','statezip','country']

USA    4600
Name: country, dtype: int64